{
  "projects": [
    {
      "projectId": 1,
      "projectType": "PERSONAL PROJECT",
      "title": "Job Tracker",
      "description": "Job Tracker allows job seekers to easily stay organised with their job search. Users can track applications, update and save details such as interview dates and job sites, and track the application status. Users can also search saved applications by job title or company name. The app is built in Flutter (Dart), using Hive for local storage, and published as an Android app on Google Play Store.",
      "projectURL": "https://play.google.com/store/apps/details?id=com.job_application_tracker",
      "imageURL": "/images/job-tracker.jpg",
      "skills": ["Dart", "Flutter", "Hive"]
    },
    {
      "projectId": 2,
      "projectType": "TEAM PROJECT",
      "title": "Where to Go",
      "description": "Where to Go enables users to easily search for and organise travel itineraries based on their preferences. Users can share and explore itineraries, comment and vote on trips, and filter by budget, location, or trip length. The app is built with Next.js and styled using Tailwind CSS, utilising Vercel Postgres and Vercel Blob for storage. The live site is hosted on Vercel.",
      "projectURL": "https://travel-app-vert-five.vercel.app/",
      "gitHubURL": "https://github.com/AkivaKn/travel_app",
      "demoURL": "https://youtu.be/KovFLKyPz5Y",
      "imageURL": "/images/where-to-go.jpg",
      "skills": ["JavaScript", "Next.js", "Tailwind CSS", "PSQL", "Vercel"]
    },
    {
      "projectId": 3,
      "projectType": "PERSONAL PROJECT",
      "title": "My Recipes",
      "description": "I created this recipe app to organise my family's recipes, allowing easy searching and filtering with categories and custom collections. JQuery was used to manipulate data client-side, to enable copy/paste of ingredients and instructions from a word document. The app was built in ASP.NET using Bootstrap for styling, an SQL database and Azure for hosting. ",
      "extendedDescription": [
        "An ASP.NET Core MVC web app using an SQL database and styled with Bootstrap. Users can create collections and edit/delete their own recipes. Admin users can approve new users and edit/delete any recipe."
      ],
      "gitHubURL": "https://github.com/AkivaKn/my-recipes",
      "demoURL": "https://vimeo.com/975291430?share=copy",
      "imageURL": "/images/my-recipes.jpg",
      "skills": ["C#", "ASP.NET", "Bootstrap", "Azure", "SQL"]
    },
    {
      "projectId": 4,
      "projectType": "TEAM PROJECT",
      "title": "What You Looking App?",
      "description": "What You Looking App? makes exploring fun and informative, allowing users to scan their surroundings with their camera feed and see points of interest (POIs) in Augmented Reality. Users can save POIs, as well as see further imformation such as distance, ratings and reviews. The app was built in React Native (TypeScript), using ViroReact to integrate Augmented Reality.",
      "extendedDescription": [
        "A React Native app using ViroReact Augmented Reality technology to display nearby points of interest on a live camera feed."
      ],
      "gitHubURL": "https://github.com/AkivaKn/what-you-looking-app",
      "demoURL": "https://northcoders.com/project-phase/what-you-looking-app",
      "imageURL": "/images/what-you-looking-app.jpg",
      "skills": ["JavaScript", "CSS", "TypeScript", "React Native", "ViroReact"]
    },
    {
      "projectId": 5,
      "projectType": "PERSONAL PROJECT",
      "title": "News Now",
      "description": "This Reddit style news website makes use of an Express.js API to retrieve and modify data. Users can filter articles, and vote and comment on individual articles. The front-end was built with React and styled with styling components.",
      "extendedDescription": [
        "This Reddit style news website makes use of an Express.js API to retrieve and modify data. Users can filter articles, and vote and comment on individual articles. The front-end was built with React and styled with styling components."
      ],
      "gitHubURL": "https://github.com/AkivaKn/nc-news",
      "projectURL": "https://clever-florentine-559ede.netlify.app/",
      "imageURL": "/images/news-now.jpg",
      "skills": ["React", "JavaScript", "CSS", "Node.js","Express.js","PSQL", "Axios"]
    }
  ]
}
